app/controllers/api/robots_controller.rb

SELECT "robots".* FROM "robots"
---
    def index
      @robots = Robot.all

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "robots" SET "x_position" = $1, "y_position" = $2, "facing" = $3, "updated_at" = $4 WHERE "robots"."id" = $5  [["x_position", 0], ["y_position", 0], ["facing", "NORTH"], ["updated_at", "2020-11-05 16:23:48.726907"], ["id", 1]]
---
    def orders
      robot = Robot.find(params[:id])
      placing_bot = params[:commands].first.split(' ')
      if placing_bot.first == 'PLACE'
        moving_coordinates = placing_bot.second.split(',')
        if moving_coordinates.first.to_i.negative? || moving_coordinates.second.to_i.negative?
          render json: { error: 'Cannot place bot on falling position', status: 400 }, status: 400
        else
          robot.update_attributes(x_position: moving_coordinates.first.to_i,
                                  y_position: moving_coordinates.second.to_i,
                                  facing: moving_coordinates.last)